Revit 2024 API
HandRailType.SupportJustification Property
 The support justification method of the handrail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public RailSupportJustification SupportJustification { get; set; }
Visual Basic
Public Property SupportJustification As RailSupportJustification
	Get
	Set
Visual C++
public:
property RailSupportJustification SupportJustification {
	RailSupportJustification get ();
	void set (RailSupportJustification value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: The rail has no support or the support layout is not fixed distance so the data being set is not applicable.
See Also
HandRailType Class
Autodesk.Revit.DB.Architecture Namespace